{
  "schema_version": "cbsp21_patch_manifest_v1",
  "patch_id": "CAT-0022",
  "title": "Resolved comment dedupe with optimized backward-scanning pagination",
  "intent": "Prevent duplicate resolved comments on the rolling drift issue when multiple green transitions occur for the same drift episode. Uses a drift-resolved-for-period marker keyed by firstDetectedIso, with optimized backward pagination that stops scanning once comments are older than the episode cutoff.",
  "change_type": "ci",
  "behavior_change": "compatible",
  "risk_level": "low",
  "scope": {
    "paths_in_scope": [
      ".github/workflows/"
    ],
    "files_expected_to_change": [
      ".github/workflows/contract-parity-main-observer.yml"
    ],
    "out_of_scope_notes": "No changes to package code, tests, or schemas. Only the green-path GitHub Script in the nightly observer workflow is modified."
  },
  "diff_range": {
    "base": "214511a",
    "head": "28beef4"
  },
  "changed_files_count": 1,
  "changed_files_exact": [
    ".github/workflows/contract-parity-main-observer.yml"
  ],
  "diff_articulation": {
    "what_changed": [
      "Added RESOLVED_PERIOD_MARKER constant: <!-- drift-resolved-for-period: <firstDetectedIso> --> keyed to the drift episode start timestamp",
      "Added alreadyResolvedForThisPeriod() async function: scans issue comments for an existing resolved marker matching this episode",
      "Pagination scans newest-to-oldest pages (backward from last page) using existing.comments count to compute startPage — no extra issues.get API call",
      "Early-stop optimization: if the newest comment on a page is older than firstDetectedIso cutoff, all earlier pages are skipped (returns false)",
      "Per-comment cutoff filter: skips individual comments older than firstDetectedIso within mixed-age pages",
      "Fail-safe cap: MAX_PAGES=50 (up to 5000 comments); returns true if cap is hit to prevent spam",
      "Wrapped createComment in if (!already) guard to skip posting when a resolved comment already exists for this period",
      "RESOLVED_PERIOD_MARKER included in comment body for future dedupe scans"
    ],
    "why_not_redundant": "Without this change, every nightly green run re-posts a resolved comment on the same rolling issue. On quiet repos with multi-day green streaks, this leads to comment spam. The backward-scan with cutoff stop avoids traversing old comment history, keeping API usage proportional to the episode lifetime rather than the full issue history."
  },
  "verification": {
    "commands_run": [
      "python scripts/validate_oncall_rotation_schema.py",
      "python scripts/check_oncall_rotation_manifest.py",
      "python scripts/check_oncall_rotation_schema_manifest.py"
    ],
    "test_results": [
      "oncall rotation schema OK",
      "oncall rotation manifest OK",
      "oncall rotation schema manifest OK"
    ],
    "notes": "All 3 oncall contract validators pass. The observer workflow is a GitHub Actions YAML file; runtime correctness is verified at execution time by GitHub Actions. The change is defense-in-depth: if the dedupe check fails or returns false erroneously, worst case is a duplicate comment (no data loss or workflow failure). The fail-safe cap ensures the dedupe scan itself cannot cause runaway API usage."
  },
  "file_context_coverage_percent": 100.0,
  "metadata": {
    "author": "GitHub Copilot",
    "created_at": "2026-02-16T00:00:00Z",
    "reviewers": []
  }
}
